; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-18)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 4 of 18
2. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 4 of 18
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 4 of 18
4. (drop ball8 roomb right)
   deleted: (carry ball8 right)
   added: (at ball8 roomb) (free right)
   goals met: 5 of 18
5. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 6 of 18
6. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 6 of 18
7. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 6 of 18
8. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 6 of 18
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 6 of 18
10. (drop ball6 roomb right)
   deleted: (carry ball6 right)
   added: (at ball6 roomb) (free right)
   goals met: 7 of 18
11. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 8 of 18
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 8 of 18
13. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 8 of 18
14. (pick ball18 rooma right)
   deleted: (at ball18 rooma) (free right)
   added: (carry ball18 right)
   goals met: 8 of 18
15. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 18
16. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 9 of 18
17. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 9 of 18
18. (drop ball18 room4 right)
   deleted: (carry ball18 right)
   added: (at ball18 room4) (free right)
   goals met: 10 of 18
19. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 10 of 18
20. (pick ball17 rooma left)
   deleted: (at ball17 rooma) (free left)
   added: (carry ball17 left)
   goals met: 10 of 18
21. (pick ball16 rooma right)
   deleted: (at ball16 rooma) (free right)
   added: (carry ball16 right)
   goals met: 10 of 18
22. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 10 of 18
23. (drop ball16 room4 right)
   deleted: (carry ball16 right)
   added: (at ball16 room4) (free right)
   goals met: 11 of 18
24. (drop ball17 room4 left)
   deleted: (carry ball17 left)
   added: (at ball17 room4) (free left)
   goals met: 12 of 18
25. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 12 of 18
26. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 12 of 18
27. (pick ball15 rooma left)
   deleted: (at ball15 rooma) (free left)
   added: (carry ball15 left)
   goals met: 12 of 18
28. (pick ball14 rooma right)
   deleted: (at ball14 rooma) (free right)
   added: (carry ball14 right)
   goals met: 12 of 18
29. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 12 of 18
30. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 13 of 18
31. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 14 of 18
32. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 14 of 18
33. (pick ball13 rooma left)
   deleted: (at ball13 rooma) (free left)
   added: (carry ball13 left)
   goals met: 14 of 18
34. (pick ball12 rooma right)
   deleted: (at ball12 rooma) (free right)
   added: (carry ball12 right)
   goals met: 14 of 18
35. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 14 of 18
36. (drop ball12 room3 right)
   deleted: (carry ball12 right)
   added: (at ball12 room3) (free right)
   goals met: 15 of 18
37. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 16 of 18
38. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 16 of 18
39. (pick ball11 rooma left)
   deleted: (at ball11 rooma) (free left)
   added: (carry ball11 left)
   goals met: 16 of 18
40. (pick ball10 rooma right)
   deleted: (at ball10 rooma) (free right)
   added: (carry ball10 right)
   goals met: 16 of 18
41. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 16 of 18
42. (drop ball11 room3 left)
   deleted: (carry ball11 left)
   added: (at ball11 room3) (free left)
   goals met: 17 of 18
43. (drop ball10 room3 right)
   deleted: (carry ball10 right)
   added: (at ball10 room3) (free right)
   goals met: 18 of 18
